[
  {
    "projectName": "Architome",
    "projectDescription": [
      "This is a game that i've been passionately working on"
    ],
    "programmingLanguageUsed": "C#",
    "linesOfCode": "20,000",
    "gitHubLink": "https://github.com/angeloje97/architome-source-code",
    "videos": [
      {
        "videoName": "Randomly Generated Tiles",
        "videoLink": "https://www.youtube.com/watch?v=1X5Bg-aixKI",
        "videoDescription": [
          "I use a seed to generate rooms that build on eachother.",
          "The map is given a bunch of paths and every path has a room anchor.",
          "If the path is not in use, then the map will use that room anchor and spawn the room there."
        ],
        "gitHubLinks": [
          {
            "linkName": "MapRoomGenerator.cs",
            "link": "https://github.com/angeloje97/architome-source-code/blob/main/MapBehavior/MapRoomGenerator.cs"
          },
          {
            "linkName": "RoomInfo.cs",
            "link": "https://github.com/angeloje97/architome-source-code/blob/main/MapBehavior/RoomInfo.cs"
          },
          {
            "linkName": "PathInfo.cs",
            "link": "https://github.com/angeloje97/architome-source-code/blob/main/MapBehavior/PathInfo.cs"
          }
        ]
      },
      {
        "videoName": "Self Opening Paths",
        "videoLink": "#",
        "videoDescription": [
          "At the end of the room generation, all the paths run a check path function.",
          "The first thing it does is collects an array of colliders using physics.overlapsphere() functions given a radius",
          "It then iterates through the collection to see if there is another path.",
          "If there is another path, it checks if the other path has the same transform position and transform rotation as the current path's room anchor.",
          "If it does then it just disables the wall that obstructs the path between rooms."
        ],
        "gitHubLinks": [{}]
      }
    ]
  },
  {
    "projectName": "Flappy Bird Clone",
    "projectDescription": [
      "This is the final project for my first cs class that I took "
    ],
    "programmingLanguageUsed": "Python",
    "linesOfCode": "2,241",
    "gitHubLink": "#",
    "videos": [
      {
        "videoName": "Flappy Bird Gameplay",
        "videoLink": "https://youtu.be/NCU0pDFihjo",
        "videoDescription": [
          "Starting this project was the first time I was learning how to render objects onto the screen. ",
          "I had to create a little mini physics engine that included gravity, jumping, and handling hit boxes. ",
          "I had to implement my own timer to spawn the walls coming from the right at a certain time. ",
          "The obstacles that were moving from right to left had to be destroyed since they were moving out of frame and were not needed."
        ],
        "gitHubLinks": [{}]
      }
    ]
  },
  {
    "projectName": "Black Jack Game",
    "projectDescription": [
      "This was a random project that I worked on when I was learning C# and WPF"
    ],
    "programmingLanguageUsed": "C#",
    "linesOfCode": "2,410",
    "gitHubLink": "#",
    "videos": [
      {
        "videoName": "Black Jack Gameplay",
        "videoLink": "https://youtu.be/-UgfqYroun0",
        "videoDescription": [
          "This video showcases my black jack game. The game would just play as a black jack game would play. ",
          "The user presses play and they would enter an amount of chips they would bet. The rest is just black jack rules."
        ],
        "gitHubLinks": [{}]
      }
    ]
  },

  {
    "projectName": "Web Applications",
    "projectDescription": [
      "Here are a bunch of mini projects that I've worked on during my web developement class. ",
      "We learned about html, css, java servlets, incorporating a database in a website, and jsp."
    ],
    "programmingLanguageUsed": "Java",
    "linesOfCode": "2,770",
    "gitHubLink": "#",
    "videos": [
      {
        "videoName": "Class Assignments and Submission Web Application",
        "videoLink": "https://youtu.be/iLAXljHjOjw",
        "videoDescription": [
          "This video show cases session tracking, dynamic web, data structure, incorporating a database, and other cool stuff ",
          "First we get all of our data from the data base. Things like teachers, students, courses, assignments, and submissions ",
          "I've created a log in feature that will log into an account that the database has. There's different types of accounts as well, ",
          "such as a teacher account or a student account. What makes the web page dynamic is that it shows different information depending on ",
          "if the person logged in is a student or a teacher. It shows a create submission if you're a teacher and it shows submit assignment if ",
          "you're a student."
        ],
        "gitHubLinks": [{}]
      },
      {
        "videoName": "Course Mapping Web Application",
        "videoLink": "https://youtu.be/GNpuIFS_ds0",
        "videoDescription": [
          "This is a simple web application that allows a person to add a quarter or semester ",
          "It also allows the user to pair a quarter with a semester given that both haven't been paired yet. ",
          "A database has also been incorporated in this"
        ],
        "gitHubLinks": [{}]
      },
      {
        "videoName": "Classes and Links Web Application",
        "videoLink": "https://youtu.be/Ah8DtsXaFD4",
        "videoDescription": [
          "This web application allows the user to add different classes which the user is allowed to name. ",
          "And each class would have a list of links and the links are a row with 2 columns which is the link name and the url",
          "The user can switch between classes so links from one class doesn't show up on another class."
        ],
        "gitHubLinks": [{}]
      },
      {
        "videoName": "Books and Genres Web Application",
        "videoLink": "https://youtu.be/HGXSfQ7jVlo",
        "videoDescription": [
          "This is a web application that provides the user with a list of books and along with those books the genre of the book. ",
          "Click on the genre and it'll show the list of books within that genre. ",
          "Click the number and increase the votes for that book by 1. The user can also add books along with the book genre as well."
        ],
        "gitHubLinks": [{}]
      }
    ]
  }
]
